Repository: Sergiy-Galenko/NIST-statistical-test-suite-UI_
Catalog: NIST_UI/*.resx
Languages: ru_ru, uk_ua

# buttonOpenInExcelOpeninMSExcel
source: Open in MS Excel
ru_ru: Открыть в MS Excel
uk_ua: Відкрити в MS Excel

# buttonOpenInExcelWait
source: Wait...
ru_ru: Подождите...
uk_ua: Зачекайте...

# buttonOptionsClose
source: Options <<
ru_ru: Опции <<
uk_ua: Опції <<

# buttonOptionsOpen
source: Options >>
ru_ru: Опции >>
uk_ua: Опції >>

# SelectInputFile
source: Please, select input file
ru_ru: Пожалуйста, укажите входной файл
uk_ua: Будь ласка, кажіть вхідний файл

# SelectTest
source: Please, select at least one test
ru_ru: Пожалуйста, укажите один из тестов
uk_ua: Будь ласка, оберіть один із тестів

# TestsIsdone
source: Tests is done! Elapsed time:
ru_ru: Тестирование завершено! Затрачено времени:
uk_ua: Тестування завершено! Витрачено часу:

# FileSize
source: General length of stream:
ru_ru: Общая длина последовательности:
uk_ua: Загальна довжина послідовності:

# MinFileSize
source: Minimum length of general (input) stream:
ru_ru: Минимальна длина общей (входной) последовательности:
uk_ua: Мінімальна довжина загальної (вхідної) послідовності:

# ReadFormatASCII
source: ASCII
ru_ru: Текстовый
uk_ua: Текстовий

# ReadFormatBinary
source: Binary
ru_ru: Двоичный
uk_ua: Двійковий

# ExploreStream
source: Investigated stream:
ru_ru: Исследуемая последовательность:
uk_ua: Досліджувана послідовність:

# BlockLengthForTest
source: The length of the block for dough
ru_ru: Длина блока для теста
uk_ua: Довжина блоку для тесту

# ErrorMinimumLength
source: The length of the sequence to test larger than the input file. How to fix: - Select a larger file - Reduce the length of sequences for testing
ru_ru: Длина указанной последовательности для тестирования больше чем входной файл. Как исправить: - Выбрать больший файл - Уменьшить длину последовательности для тестирования
uk_ua: Довжина вказаної послідовності для тестування більша ніж вхідний файл. Як виправити: - обрати більший файл - зменшити довжину послідовності для тестування

# toolTipbuttonFileOfAnalysis
source: Open file of Analysis
ru_ru: Открыть файл анализа
uk_ua: Відкрити файл аналізу

# toolTipbuttonOpenDirectoryOfExperiments
source: Open directory of experiments
ru_ru: Открыть папку тестов
uk_ua: Відкрити каталог тестів

# toolTipbuttonOpenInExcel
source: Open analysis file in MS Excel
ru_ru: Открыть файл анализа в MS Excel
uk_ua: Відкрити файл аналізу в MS Excel

# toolTipbuttonOptions
source: Show / Hide options
ru_ru: Показать / Скрыть опции
uk_ua: Показати / Приховати опції

# toolTipbuttonSelectFile
source: Specify a input file
ru_ru: Указать входной файл
uk_ua: Вказати вхідний файл

# toolTipbuttonTest
source: Run tests
ru_ru: Начать тестирование
uk_ua: Почати тестування

# toolTipbuttonTestStop
source: Stopping testing
ru_ru: Остановить тестирование
uk_ua: Зупинити тестування

# toolTipcheckBoxSelectAll
source: Select all tests
ru_ru: Выбрать все тесты
uk_ua: Вибрати всі тести

# toolTipcomboBoxReadFormat
source: Binary - Each byte in data file contains 8 bits of data. ASCII - A sequence of ASCII 0's and 1's.
ru_ru: Двоичный - каждый байт в файле состоит из 8-ми бит данных. Текстовый - Последовательность с 1 и 0 таблицы ASCII.
uk_ua: Двійковий - кожен байт у файлі складається з 8-ми біт даних. Текстовий - Послідовність з 1 та 0 таблиці ASCII.

# toolTiplabelFileSize
source: If this label is highlighted in red is the length of the sequence to test larger than the input file. How to fix: - Select a larger file - Reduce the length of sequences for testing
ru_ru: Если эта надпись выделен красным - длина указанной последовательности для тестирования больше чем входной файл. Как исправить: - Выбрать больший файл - Уменьшить длину последовательности для тестирования
uk_ua: Якщо цей напис виділений червоним - довжина вказаної послідовності для тестування більша ніж вхідний файл. Як виправити: - обрати більший файл - зменшити довжину послідовності для тестування

# toolTipprogressBar1
source: Progress of testing
ru_ru: Прогресс тестирования
uk_ua: Прогрес тестування

# toolTipradioButtonInputFile
source: As a generator to choose the input file
ru_ru: В качестве генератора выбрать входной файл
uk_ua: В якості генератора обрати вхідний файл

# toolTiptextBoxBitStream
source: Number of sequences
ru_ru: Количество последовательностей
uk_ua: Кількість послідовностей

# toolTiptextBoxN
source: The length of a one sequence
ru_ru: Длина одной последовательности
uk_ua: Довжина однієї послідовності

# toolTiptoolStripDropDownButton1
source: Change language
ru_ru: Изменить язык
uk_ua: Змінити мову
