Repository: Sergiy-Galenko/NIST-statistical-test-suite-UI_
Catalog: NIST_UI/MyForm.*.resx
Languages: ru_ru

# buttonTest.Text
source: T E S T
ru_ru: Тест

# radioButtonInputFile.Text
source: Input File
ru_ru: Входной файл

# labelFileSize.Text
source: General length of stream: -
ru_ru: Длина последовательності: -

# labelReadFormat.Text
source: Read format
ru_ru: Формат чтения

# groupBoxGeneratorSelection.Text
source: Generator selection
ru_ru: Выбор генератора

# checkBoxSelectAll.Text
source: Select All
ru_ru: Выбрать все

# checkBoxSelectAll.ToolTip
source: Select all tests
ru_ru: Выбрать все тесты

# groupBoxStatisticalTest.Text
source: Statistical tests
ru_ru: Статистические тесты

# buttonOptions.Text
source: Options >>
ru_ru: Опции >>

# groupBoxOptions.Text
source: Parameter Adjustments from Tests ( block lenght )
ru_ru: Дополнительные параметры тестов (длинна блока)

# label11.Text
source: Lenght of bit
ru_ru: Количество последовательностей

# label10.Text
source: Number of bit generated
ru_ru: Длина последовательности (бит)

# groupBoxStream.Text
source: Stream
ru_ru: Последовательность

# buttonOpenInExcel.Text
source: Open in MS Excel
ru_ru: Открыть в MS Excel

# buttonFileOfAnalysis.Text
source: Open analysis file
ru_ru: Открыть файл анализа

# buttonOpenDirectoryOfExperiments.Text
source: Directory of Experiments
ru_ru: Папка тестов

# buttonTestStop.Text
source: S T O P
ru_ru: Остановить

# groupBoxReport.Text
source: Report of current tests
ru_ru: Отчет текущих тестов

# toolStripStatusLabel1.Text
source: Language:
ru_ru: Язык:

# toolStripMenuItemViewHelp.Text
source: View Help
ru_ru: Показать справку

# toolStripMenuItemAboutNIST.Text
source: About NIST STS
ru_ru: О NIST STS

# toolStripMenuItem1.Text
source: Help
ru_ru: Справка
